{
    "Softversko inženjerstvo i informacione tehnologije":{
        "Stepen i vrsta studija": "Osnovne akademske studije",
        "Zvanje koje se stiče": "Diplomirani inženjer softvera (Dipl.inž.softv.)",
        "Obrazovno polje": "Tehničko-tehnološke nauke",
        "Naučno, umetničke - stručne oblasti": "Elektrotehničko i računarsko inženjerstvo",
        "Trajanje (god/sem)": "4 / 8",
        "Ukupan broj ESPB bodova": "242",
        "Predmeti": [
            {
                "ime": "Osnove programiranja",
                "cilj": "Упознавање студената са основним концептима, елементима и структуром рачунарских програма, и основним алгоритмима за обраду података.",
                "ishod": "Након успешно завршеног курса студент познаје концепте рачунарских програма и пише програме који врше интеракцију са корисником; рукује различитим типовима података у рачунарском програму; користи основне структурне елементе програма: секвенце, селекције и итерације; користи потпрограме и врши декомпозицију сложенијих програма; познаје елементе процеса развоја програма; познаје елементе анализе алгоритама.",
                "sadrzaj": "Појам рачунарског програма: улога хардвера и софтвера у рачунарском систему; принципи рада модерног рачунара; облик и сврха програмских језика; карактеристике програмског језика Python; елементи Python програма. Руковање бројевима: појам типова података; нумерички типови података; репрезентација бројева у рачунару; акумулаторске променљиве; коришћење математичких функција. Руковање стринговима: појам стринга и његова рачунарска репрезентација; операције над стринговима; форматирање стрингова. Гранање у програму: појам гранања у програму; једноструко, двоструко и вишеструко гранање; обрада изузетака. Петље и логички изрази: појам петље; коначна и бесконачна петља; интерактивна и сентинел петља; угњеждене петље; Булова алгебра и Булови изрази. Потпрограми: декомпозиција програма; позивање потпрограма; пренос параметара и резултата; колекције потпрограма; појам и примена рекурзије. Колекције података: појам низа; операције над низовима; вишедимензионални низови; појам речника; операције над речником. Развој програма: репрезентација реалног система у рачунарском програму; топ-доwн и спиралне технике развоја програма; тестирање програма. Анализа алгоритама: основне за анализу ефикасности алгоритама; појам претраживања, линеарна и бинарна претрага; појам и алгоритми сортирања."
            },
            {
                "ime": "Arhitektura računara",
                "cilj": "Упознавање студената са основним појмовима рачунарске архитектуре, принципима рада, структурном организацијом рачунара и начинима његове имплементације.",
                "ishod": "Познавање основних делова рачунара, принципа рада и нивоа организације, способност процене ефикасности употребе различитих рачунарских имплементација у одређене сврхе, способност разликовања рачунарских система на основу њихових параметара, способност практичне примене стечених знања.",
                "sadrzaj": "Увод у архитектуру рачунара (основни појмови, кратка историја и еволуција, рачунарске врсте); Организација рачунарских система (процесори, примарна и секундарна меморија, У/И); Дигитална логика (Булова алгребра, основна логичка кола, меморија, чипови и магистрале са примерима); Микроархитектура (начини имплементације са примерима); Архитектура скупа машинских инструкција (типови података, формати инструкција, адресирање, типови инструкција, контрола тока, примери); Оперативни систем рачунара (виртуелна меморија и У/И инструкције, примери оперативних система); Асемблерски језик (основни појмови, макрои, процес асемблирања, линковање и учитавање); Архитектуре паралелних рачунара (паралелизам на чипу, копроцесори, мултипроцесори, мултикомпјутери са разменом порука)"
            },
            {
                "ime": "Algebra",
                "cilj": "Osposobljavanje studenata na apstraktno mišljenje i sticanje osnovnih znanja iz oblasti elementarne, opšte, apstraktne i linearne algebre, kao i iz osnova klasične kombinatorike. Cilj predmeta je da kod studenta razvije poseban nacin ramisljanja pri proučavanju principa linearne algebra i njene primene. To znanje je temelj za bolje razumevanje stručne literature i za uspešan nastavak u studijama.",
                "ishod": "Стечена знања користе се у даљем образовању и у струцним предметима, конструишу се и решава математички модели из струцних предмета користеци градиво овога предмета. На основу стечених занања студенти умеју да примене методе линеарне алгебре и да изаберу алгоритме за решавње будућих проблема из стручних предмета.",
                "sadrzaj": "Предавања (теоријска настава). Логика, релације, функције, Булова алгебра, групе, прстени, поља, полиноми, комплексни бројеви, коначна поља, слободни вектори, аналитичка геометрија у простору (векторски!), детерминате, системи линеарних једначина, векторски простори, матрице, карактеристични корени и вектори. Практицна настава (вежбе): На вежбама се раде одговарајуци примери и тестови са теоријске наставе којим се увежбава дато градиво а самим тим вежбе доприносе и разумевању датог градива."
            },
            {
                "ime": "Sociologija tehnike",
                "cilj": "Оспособљеност инжењера да схвате друштвени значај и улогу технике у развоју друштва, позитине и негативне утицаје технике на развој друштва и човека, као и властити друштвени значај и одговорност у стварању хуманог друштва.",
                "ishod": "Стицање социолошких сазнања о особинама, изворима, друштвеним функцијама и ствараоцима техничког сазанања; знања о утицају природе друштвених система на развој технике и утицају технике на развој друштва; знања о утицају технике на процесе глобализације, на уништавање природе и стварање ризичног друштва; знања о утицају технике на промене садржаја рада и облика организације рада; знања о утицају средстава масовних комуникација на живот људи, образовање, културу и демократију.",
                "sadrzaj": "Техничко сазнање: особине ии друштвене функције технике, извори техничког сазнања, ствараоци техничког сазнања, ширење техничког сазнања, научно-технички потенцијал, однос науке и технике.Однос технике и друштва: утицај друштва на развој технике и утицај технике на развој друштва-Индустријско и информатичко друштво. Утицај технике на живот, свест и културу.Техника и глобализација: узроци и димензије глобализације, технолошки јаз, бег мозгова; Техника и организација рада: флексибилна производња, умрежене организације, економија знања, електронска економија.Техника и рад: скраћење радног времена, промена садржаја рада, опадање значаја рада.Техника и отуђење у раду: утицај технике на отуђење у раду, облици отуђења, хуманизација рада Масовни медији и комуникације: глобална телевизија, утицај телевизије на друштво, теорије о медијима, мобилна телефонија и интернет, утицај интернета на друштво, медијски империјализам, масовна култура, сајбер криминал.Техника и образовање: образовање и нове комуникацијске технологије, образовање и технолошки јаз, виртуелни универзитети, интелигенција и образовни успех.Техника и демократија: глобални медији и ширење либералне демократије, медији и виртуелна стварност, отпор и алтернативе глобалним медијима. Техника и еколошка криза: глобално загревање, генетски модификована храна, технички ризици, техничко друштво као ризично Техничка интелигенција : друштвени положај и утицај, инжењерска етика."
            },
            {
                "ime": "Web dizajn",
                "cilj": "Оспособљавање студената за руковање технологијама израде wеб садржаја и упознавање са принципима wеб дизајна.",
                "ishod": "Студенти су оспособљени за самостални рад у домену формирања сложених wеб садржаја.",
                "sadrzaj": "Основне технологије за израду веб садржаја: HTML(5), CSS(3) . Основе HTTP протокола. Мултимедијални типови података на вебу. Препоруке за дизајн страница и сајта. Развој веб страница са акцентом на њихову употребљивост и корисничко искуство UX. Употреба JavaScripta за повећање интерактивности страница. Прилагодљивости саржаја различитим излазним уређајима (responsive design). Технике за повећање доступности садржаја за особе са посебним потребама. Упознавање са системима за управљање садржајем веб сајта (CMS)."
            },
            {
                "ime": "Internet mreže",
                "cilj": "Овладавање теоријским основама и технологијама TCP/IP мрежа.",
                "ishod": "Овладавање основним теоријским знањима о TCP/IP мрежама. Оваладавање практичним знањима потребнима за пројектовање, имплементацију и одржавање локалних рачунарских мрежа базираних на TCP/IP моделу.",
                "sadrzaj": "Стандарди у мрежама и тела за стандардизацију. Пасивна и активна опрема потребна за реализацију рачунарских мрежа, структуирано каблирање. TCP/IP мреже: ISO референтни модел и TCP/IP, пренос података (основе протокола OSI 1), ethernet и серијске везе (основе протокола OSI 2), IPv4, ICMPv4, принципи рутирања, протоколи за динамичко рутирање, UDP, TCP, DNS, IPv6, ICMPv6, Комуникациони уређаји: хаб, свич, рутер. Мрежни сервиси (SMTP). Еволуција кампус мрежа, (VLAN, VPN). Надгледање, управљање, заштита мреже: SNMP, пакетско филтрирање, криптографија, заштитне баријере, контролисани приступ, сервиси именовања, аутентификациони протоколи, дигитални потписи. Бежичне комуникације и мобилно рачунарство: еволуција, кампатибилност стандарда, специфичности, бежични LAN-ovi и сателитски базиране мреже, мобилни Интернет протокол."
            },
            {
                "ime": "Objektno orijentisano programiranje 1",
                "cilj": "Оспособљавање студената за решавање проблема из области објектно оријетнисаног програмирања.",
                "ishod": "Познавање метода, технологија и стандарда за развој објектно оријентисаних апликација. Студент је компентентан да пројектује објектно оријентисане апликације засноване на програмском језику Јава.",
                "sadrzaj": "Основни појмови и термини. Објекти, класе, везе и методе. Енкапсулација. Креирање објеката, конструктори, Garbage Collection. Наслеђивање. Апстрактне класе и интерфејси. Преклапање метода. Генерички тип податка. Изузеци. Основе Swing графичког корисничког интерфејса."
            },
            {
                "ime": "Algoritmi i strukture podataka",
                "cilj": "Упознавање студената са структурама података у оперативној меморији и развојем програма који их користе.",
                "ishod": "Након успешно завршеног курса студент познаје концепте апстрактних типова података; рукује линеарним структурама података – низовима, скуповима, мапама, листама, стековима, редовима; познаје концепте анализе ефикасности алгоритама; користи поступке за претраживање и сортирање података; познаје и користи рекурзију у дизајну програма; познаје и користи хеш табеле; познаје и користи стабла.",
                "sadrzaj": "Апстрактни типови података: појам апстрактног типа података; дефинисање нових типова. Низови: појам низа; операције над низовима; анализа ефикасности операција над низовима; појам матрице; операције над матрицама. Скупови и мапе: појам скупа; имплементација скупа; појам мапе; имплементација мапе; вишедимензионални низови и операције над њима. Анализа алгоритама: О-нотација; анализа функционисања Пyтхон листе. Претраживање и сортирање: линеарна и бинарна претрага; алгоритми за сортирање; операције над сортираним низовима. Листа, стек и ред: једноструко спрегнуте листе: појам и операције; примене листи; двоструко спрегнуте листе; стек - појам и операције; ред - појам и операције; имплементација стека и реда; вишеструко спрегнуте листе. Рекурзија. појам и особине рекурзије; имплементација рекурзије; примене рекурзије. Хеш табеле: појам хеш функције; хеш табеле - појам и операције; примене хеширања. Стабла: бинарна стабла - појам и операције; Н-арна стабла; стабла за претраживање."
            },
            {
                "ime": "Matematička analiza",
                "cilj": "Циљ предмета је стицање основних знања из области математичке анализе неопходних за даље изучавање блиских предмета и оспособљавање студената за апстрактно мишљење. Стечена знања из математичке анализе студент треба да примени у моделовању реалних проблема из области техничких наука.",
                "ishod": "Студент треба да научи основне појмове математичке анализе - низове, граничне процесе, диференцијални и интегрални рачун, обичне диференцијалне једначине и нумерички редове и да уме да их примењује. Стечена знања користи у даљем образовању и у стручним предметима. Студент је оспособљен да прави и решава математичке моделе из стручних предмета користећи градиво из математичке анализе.",
                "sadrzaj": "Предавања: Поље реалних и комплексних бројева. Метрички простори. Низови (конвергенција низа, реални и комплексни низови, комплетни метрички простори). Бројни редови. Гранична вредност, непрекидност и униформна непрекидност функција. Реалне функције једне реалне променљиве (гранична вредност, непрекидност, униформна непрекидност, диференцијални рачун и примена, неодређени интеграл, одређени интеграл и примена, несвојствени интеграл). Реалне функције више реалних променљивих (гранична вредност, непрекидност, униформна непрекидност, диференцијални рачун и примена). Обичне диференцијалне једначине првог и вишег реда. Линеарне диференцијалне једначине н-тог реда. Вежбе: На вежбама се раде одговарајући примери са теоријске наставе којим се увежбава градиво, а самим тим вежбе доприносе и разумевању градива."
            },
            {
                "ime": "Objektno orijentisano programiranje 2",
                "cilj": "Упознавање студената са напредним концептима објектно-оријентисаног приступа употребом програмског језика Це++ и развојем програма истовременом употребом више програмерских парадигми (multi-paradigm programming)",
                "ishod": "Студент који успешно заврши курс упознат је са могућностима програмског језика Це++; уме да ефикасно користи елементе стандардне библиотеке; схвата основне принципе на којима је објектно оријентисан језик развијен; упознат је са предностима и недостацима језика и уме да препозна ситуације у којима је примерено користити језик Це++; свестан је на који начин језик подржава различите приступе програмирању и препознаје предности и недостатке сваког од подржаних приступа;",
                "sadrzaj": "Увод: основне карактеристике језика, еволуција језика. Организација програма: заглавља и библиотеке. Структура Це++ програма: глобалне функције, функција main(), класе, шаблони (функција и класа). Аутоматски генерисане функције чланице: конструктори и оператори доделе. Токови података: улаз и излаз, датотеке, прилагођавање токова. Категорије израза: rvalue, lvalue, xvalue, glvalue, prvalue. Преношење вредности (параметри потпрограма и повратна вредност): по вредности, по показивачу, по лвалуе референци, по рвалуе референци. Грешке у програму: реакција програма на појаву грешке, појава изузетка, обрада изузетака, класе изузетака из стандардне библиотеке. Елементи стандардне библиотеке: знаковни низови (стрингови), контејнери, итератори, алгоритми. Контејнери: секвенцијални (вектор, стек (стог), листа, ред), асоцијативни-уређени и асоцијативни-хеширани (скуп, мапа, мулти-скуп, мулти-мапа). Итератори: улазни, излазни, једносмерни у напре и у назад, бидирекциони, са директним приступом. Алгоритми: за претраживање, измену, уређивање, операције са хипом (heap)."
            },
            {
                "ime": "Organizacija podataka",
                "cilj": "Основно образовање студената у области организације података у системима датотека и системима релационих и нерелационих (NoSQL) база података. Овладавање моделима података и физичким структурама података на екстерним меморијским уређајима. Оспособљавање студената за развој и коришћење система датотека.",
                "ishod": "Стечена знања користе се у пракси, предмету Базе података и другим стручним предметима. Након успешно завршеног курса, студент разуме принципе организације података у систему датотека и система за управљање подацима.",
                "sadrzaj": "Увод у системе датотека и системе релационих и нерелационих (NoSQL) база података. Модели података. Физичке структуре података на екстерним меморијским уређајима. Услуге оперативног система и системски позиви. Методе приступа. Методе и поступци организације датотека. Серијска, секвенцијална, расута, индекс-секвенцијална и индексна датотека с Б стаблом."
            },
            {
                "ime": "Numerički algoritmi i numerički softver",
                "cilj": "Овладавање основним знањима из нумеричке анализе, овладавање методоологијом примене нумеричких модела у инжењерским дисциплинама, овладавање коришћењем одабраног стандардног нумеричког софтверског алата.",
                "ishod": "Разумевање основних нумеричких метода и способност њихове примена у решавању једноставнијих инжењерских задатака коришћењем нумеричких софтверских алата.",
                "sadrzaj": "Математички модели и нумерички модели; методологија решавања инжењерских проблема применом нумеричких модела; области примене нумеричких модела у инжењерству. Основни нумерички поступци: нумеричко решавање система линеарних алгебарских једначина (директни и итеративни поступци); нумеричко решавање нелинеарних једначина и система; апроксимација функција (интерполација и најбоља апроксимација); диференцирање и интеграција (коначне разлике, Њутн-Котесове формуле, Ромбергов метод); обичне диференцијалне једначине - почетни услов (једнокорачне и вишекорачне формуле, предиктор-коректор поступци), гранични услов (метода погађања, колокационе формуле); Монте-Карло методе. Нумерички софтверски алати: захтеви и функције, архитектура, начини коришћења, расположиви алати."
            },
            {
                "ime": "Nelinearno programiranje i evolutivni algoritmi",
                "cilj": "Овладавање основним принципима нелинеарне оптимизације (нелинеарног програмирања) и основним принципима еволутивних алгоритама.",
                "ishod": "Стечена знања могу се користити у решавању конкретних инжењерски проблема, а такође представљају основу за даље праћење стручних предмета.",
                "sadrzaj": "Појам оптимизације. Поставка оптимизационог проблема. Једнодимензиона оптимизација. Потребни и довољни услови оптималности у скаларном случају. Нумеричка оптимизација функција једне променљиве. Једнодимензиони алгоритми претраге. Вишедимнзиона оптимизација без ограничења. Метод ограничене варијације. Метод Лагранжевих множитеља. Нумерички алгоритми вишедимензионе оптимизације без ограничења: градијентни алгоритам, Њутнови и квази-Њутнови алгоритми. Неалдер-Меад алгоритам. Вишедимензиона оптимизација са ограничењима. Елементи конвексног програмирања. Кун-Такерови услови. Нумеричке методе вишедимензионе оптимизације са ограничењима. Линеарно програмирање. Квадратно програмирање. Основни принципи глобалне оптимизације. Еволутивни и генетски еволутивни алгоритми. Оптимизација ројем честица. Основни принципи рада савремних глобалних алгоритама: АЦО (Ант Цолонy Оптимизатион), БФО (Бацтериа Фораггинг Оптимизатион), ..."
            },
            {
                "ime": "Diskretna matematika",
                "cilj": "Основни циљ предмета јесте оспособљавање студената на апстрактно мишљење и стицање основних знања из области класичних комбинаторних објеката, некласичних комбинаторних објеката и теорије графова. Студенти ће учити да класификују проблеме из комбинаторике, а затим и да их их решавају користећи познате комбинаторне методе, кроз усвајање теоријских знања и решавање практичних примера. Кроз учења познатих појмова и тврђења из теорије графова, студент ће бити оспособљен да поставља графовске моделе из примена у дрругим дисциплинама (нпр. рачунарству и транспорту). Особине графова биће прецизно математички доказане, са циљем да студент овлада техникама доказивања.",
                "ishod": "Као исход предмета, студенти ће поседовати основна знања из области класичних комбинаторних објеката, некласичних комбинаторних објеката и теорије графова, уз чега ће њихова способност апстрактног размишљења и вештина доказивања бити у великој мери унапређена. Студенти ће бити способни да препознају комбинаторике објекте и да их решавају познатим методама, као и да поставља графовске моделе из примене.",
                "sadrzaj": "Класични комбинаторни објекти (пермутације, варијације и комбинације са и без понављања), партиције скупова, Стирлингови бројеви, рекурентне формуле, генеративне функције, основни појмови теорије графова, повезаност графова, специјалне класе графова, изоморфизам графова, матрице суседства, операције над графовима, стабла, планарни графови, Ојлерови и Хамилтонови графови."
            },
            {
                "ime": "Uvod u softversko inženjerstvo",
                "cilj": "Оспособити студенте за примену савремених метода, алата и најбоље праксе у процесу инжењерског развоја софтвера. Омогућити јасну диференцијацију између програмирања и софтверског инжењерства и улоге модела животног циклуса софтвера у процесу инжењерства софтверских производа. Оспособити студенте за избор модела животног циклуса софтвера који најбоље одговара природи домена проблема и карактеристикама програмских производа. Подићи ниво свести о улози захтева, њихове спецификације (модела захтева) и описа интеракције корисника са развијаним софтверским производом (функционални модел) на архитектуру и принципе развоја интерактивних програмских производа.",
                "ishod": "Након успешно завршеног курса студент је у стању да: користи модерне технике и алате у развоју софтвера (интегрисана окружења, едиторе, компајлере, дебагере и др.), успешно сарађује на развоју софтвера у оквиру вишечланог тима, користи алате за колаборацију, системе за контролу верзија и системе за праћење захтева за променама, пише јединичне, интеграционе тестове и тестове прихватања, разуме предности развоја софтвера управљаног тестирањем, разуме и користи основне методошке приступе у развоју софтвера, пише документацију и користи алате за писање документације за софтвер који развија.",
                "sadrzaj": "Теоријски део: Процеси и методологије развоја софтвера; Модели животног циклуса софтвера; Упоредна анализа традиционалног схватања процеса развоја софтвера и агилне методологије. Инжењерство софтвера као професија. Преломне тачке у историји развоја дисциплине софтверског инжењерства. Корпус знања у софтверском инжењерству (SWEBOK - Software Engineering Body of Knowledge). Етички кодекс инжењерства софтвера (Software Engineering Code of Etics).Софтверски производ и процес његове израде. Преглед интегрисаних окружења за развој; предности у односу на класичне едиторе кода; ефикасна употреба интегрисаних окружења; навигација над изворним кодом; дефинисање динамичких шаблона за кодирање. Технике откривања и уклањања грешака; дебаговање. Системи за контролу верзија (Version Control System – VCS); архитектуре; алати; subversion – употреба, управљање верзијама. Основни појмови тестирање; развој софтвера вођен тестирањем; јединично тестирање; интеграционо тестирање; тест прихватања. Развој софтвера вођен понашањем; писање сценарија; писање тестова прихватања. Писање документације; документација елемената изворног кода; техничка документација; корисничко упутство; алати за писање и генерисање документације. Алати за управљање изградном и инсталацијом. Практичан део: инсталација, подешавање и употреба Eclipse интегрисаног окружења; подешавање шаблона за кодирања елемената изворног кода; техничка документација; корисничко упутство; алати за писање и генерисање документације. Алати за управљање изградном и инсталацијом. Виртуална окружења у Java-у. Практичан део: инсталација, подешавање и употреба Eclipse интегрисаног окружења; подешавање шаблона за кодирање у Java-у; дебаговање Java програма. Инсталација, подешавање и употреба клијената за subversion VCS; Subversive. Тестирање Јава програма (JUnit, doctest)."
            },
            {
                "ime": "Specifikacija i modeliranje softvera",
                "cilj": "Оспособљавање студената за ефикасно и ефективно модедловање и спецификацију софтверских система. Овладавање знањима и вештинама неопходним за анализу и спецификацију софтверских захтева. Овладавање основама модел базираног дизајна. Овладавање UML-спецификацијама.",
                "ishod": "По окончању предмета студенти су оспособљени за: анализу сложених система, спецификацију захтева према систему и софтверу и примену UML-формализама приликом моделовању статичког и динамичког понашања система и софтвера. У склопу предмета студенти овладавају расположивим, UML базираним, комерцијалним алатима за моделовање софтвера и формалну спецификацију статичког и динамичког понашања система и софтвера и моделовање архитектуре софтвера.",
                "sadrzaj": "Основни модел софтверског система. Однос спецификације захтева, спецификације дизајна и имплементације софтверских система. Основи инжењерства захтева, процес, исказивање, анализа, спецификација, верификација и валидација захтева. Израда формалног документа - спецификација захтева. Основи дизајна софтвера, статичко и динамичко моделовање. Основе UML, структура, организација и мета-модел. UML дијаграми: дијаграм случајева коришћења, дијаграми класа, дијаграми објеката, дијаграми сарадње, дијаграми секвенце, дијаграми активности, дијаграми стања. Напредно UML моделовање: интерфејси, пакети и моделовање физичке архитектуре.Архитектонски и дизајн шаблони и њихова примена у моделовању архитектуре софтверских система."
            },
            {
                "ime": "Upravljanje informacijama",
                "cilj": "Овладавање основним и напредним знањима и вештинама везаним за управљања информацијама у контексту сложених софтверских производа. Интегрисање складишта података на масовној меморији са структуром података у оперативној мреморији. Дубинско разумевање платформски независних и платформски зависних аспеката информационих ресурса.",
                "ishod": "Након успешно завршеног курса студент је у стању да: специфицира, моделује и имплементира механизме за руковање информационим ресурсима у склопу архитектуре сложених софтверских производа. Оспособљен је за употребу различитих типова складишта података, организације података и структура података при имплементацији компоненти за руковања информацијама у склопу архитектуре софтверског производа. У стању су да формулишу и имплементирају стандардне операције (додавање, измену, брисање и претраге) независно од природе и начина имплементације слоја за трајно чување (складиштење) информација.",
                "sadrzaj": "Основни појмови везани за податке, информације и знање. Формална спецификација структуре података и њено пресликавање на елементе перзистентног слоја сложених софтверских производа. Платформски независни и платформски зависни аспекти руковања подацима, информацијама и знањем. Платформски независан модел универзалног информационог ресурса, опис и пресликавање. Организација података - перзистентни слој зависан од оперативног система. Архитектура система датотека, типови датотека и операције над датотекама и унутар датотека различите организације. Моделовање информационих ресурса. Развој архитектуре перзистентног слоја сложених софтверских производа. Концептуално, логичко и физичко моделовање података. Стандардизација операција над информационим ресурсима. Стандардизација извештајног подсистема над универзалним перзистентним слојем."
            },
            {
                "ime": "Baze podataka",
                "cilj": "Основно образовање студената у области база података. Овладавање основним појмовима у области база података и основним техникама имплементације, коришћења и одржавања база података.",
                "ishod": "Стечена знања користе се у пракси и стручним предметима: Базе података 2, Спецификација и моделирање софтвера, Инжењеринг информационих система, Пословна информатика, Системи база података.",
                "sadrzaj": "Базе података и њихова улога у развоју и експлоатацији информационих система. Основни појмови и концепција базе података. ER модел података. Релациони модел података. Релациона алгебра. Типови ограничења у релационом моделу података. Основе пројектовања база података. Језик релационих система за управљање базама података SQL. Трансакциона обрада података. Систем за управљање базом података. Технике серверског програмирања."
            },
            {
                "ime": "Operativni sistemi",
                "cilj": "Упознавање студената са појмом оперативног система, његовим основним деловима и структуром, принципима рада, као и начинима за његову имплементацију.",
                "ishod": "Познавање основних делова оперативног система, његовог принципа рада и структуре, познавање различитих врста оперативних система и њихових особина, разумевање значења основних параметара оперативног система, способност практичне примене стечених знања.",
                "sadrzaj": "Увод (основни појмови, кратка историја и еволуција, структура оперативног система); Процеси (модел процеса, међупроцесна комуникација, класични проблеми, распоређивање, примери); Улаз/излаз (принципи рада У/И хардвера и софтвера, блок уређаји, дискови, терминали, мрежа); Управљање меморијом (принципи управљања меморијом, виртуелна меморија, страничење, сегментација); Фајл системи (фајлови и директоријуми, њихова имплементација, безбедност, механизми заштите, примери); Врсте оперативних система са примерима; Проучавање дизајна оперативног система са појединим детаљима имплементације, имплементација појединих делова оперативног система, увод у администрацију"
            },
            {
                "ime": "Softverski obrasci i komponente",
                "cilj": "Овладавање основним теоријским знањима, техникама, алатима и препорученом праксом из области софтверских образаца (Software Patterns) и развоја софтвера базираног на компонентама (Component-Based Development – CBD). Оспособљавање студената за уочавање образаца у контексту развоја сложених софтверских производа као и дефинисање архитектуре система базиране на софтверским компонентама.",
                "ishod": "По окончању предмета студенти су способни да, у развоју сложених софтверских апликација, уоче и примене софтверске обрасце као и да разумеју предности и мане примене препоручених софтверских образаца. Такође су оспособљени да за конкретан задатак изаберу и примене најпогоднију платформу за компонентно базиран развој, моделују архитектуру, декомпонују систем на потребан број софтверских компоненти, дефинишу интерфејсе компоненти и изврше имплементацију система.",
                "sadrzaj": "Теоријска настава: Основне дефиниције и историјат развоја софтверских образаца. Категорије софтверских образаца; Дизајн обрасци; Архитектонски обрасци. Преглед популарних образаца. Предности и мане. Каталози софтверских образаца. Антиобрасци (Anti-Patterns);основне особине; преглед карактеристичних антиобразаца. Компонентно базирани развој; основне дефиниције; историјат. Преглед постојећих компонентних модела. Предности и мане. Моделовање архитектуре апликација базираних на компонентама. Тржишта софтверских компоненти. Практична настава: обука за коришћење модерних алата за израду софтвера базираног на компонентама; имплементација пројектног задатка употребом савремених алата и оквира за развој базиран на компонентама уз акценат на правилну примену софтверских образаца."
            },
            {
                "ime": "Metodologije razvoja softvera",
                "cilj": "Упознавање студената са животним циклусом софтверског производа и различитим методологијама, стандардима и алатима који подржавају животни циклус софтверског производа у целини или у некој од његових фаза",
                "ishod": "Након успешно завршеног курса студент је упознат са различитим методологијама за развој софтвера, као и стандардима и алатима који их подржавају. По завршетку курса, студент је способан да одабере и активно примени оптималну методологију и алате за конкретни софтверски пројекат, као да образложи свој избор.",
                "sadrzaj": "Животни циклус софтверског производа; фазе животног циклуса; значај примене методологија за развој софтвера; историјат развоја методологија; модели развоја софтвера; модели базирани на водопаду; итеративни и инкрементални модели; Бемов спирални модел; модели базирани на прототиповима; агилне методологије (SCRUM, Scaled Agile Framework - SAF, екстремно програмирање, Feature Driven Development - FDD , Dynamic Systems Development Method – DSDM, Kristal, Адаптивни развој софтвера - ASD, Test Driven Development - TDD); аутоматизован развој софтвера; савремени алати за планирање, пројектовање, конструкцију и документовање; алати за подршку тимског рада и праћења напретка пројекта."
            },
            {
                "ime": "Inženjerstvo serverskog sloja",
                "cilj": "Упознавање студената са технологијама и принципима за имплементацију серверског сегмента апликација.",
                "ishod": "Студенти ће након успешно завршеног курса бити у могућности да имплементирају најразличитије модерне комплексне архитектуре серверског дела апликације. Акценат ће бити стављен на решавање познатих проблема у дистрибуираним системима употребом модерних програмских оквира и библиотека.",
                "sadrzaj": "Архитектуре серверских страна апликације. Положај различитих типова база података у оваквим архитектурама. Технологије за размену порука у дистрибуираним системима. Различите парадигме и имплементације технологија у облаку. Коришћење и имплементација технологија за управљање апликационих контејнера, Serverless computing, Function as a service (FaaS) , Platform as a service (PaaS) ."
            },
            {
                "ime": "Testiranje softvera",
                "cilj": "Оспособити студенте за примену препоручене праксе, метода, техника и алата у домену конструкције и тестирања софтвера.",
                "ishod": "Познавање принципа, техника и алата за конструисање и тестирање софтвера. Студент је компентентан да врши планирање и конструисање софтвера. Способан је да изврши аутоматизацију процеса тестирања, тестира јединице или цео софтвер. Моћи ће да изврши анализу и избор алата за тестирање, креирање тест-случајева и да спроведе ефикасно тестирање софтвера.",
                "sadrzaj": "Појам и улога тестирања у процесу развоја софтвера. Типови тестирања. Статичко тестирање. Динамично тестирање. Технике тестирања \"беле кутије\". Технике тестирања \"црне кутије\". Коришћење тест двојника. Алати, библиотеке и радни оквири за тестирање. Тестирање веб апликација. Тестирање серверског дела апликације. Тестирање клијентског дела апликације. Тестирање интегрисаног система."
            },
            {
                "ime": "Inženjerstvo klijentskog sloja",
                "cilj": "Савладавање концепата технолошких платформи и радних оквира за развој клијентских веб апликација.",
                "ishod": "Познавање концепата програмског језика ЈаваСцрипт. Познавање архитектуре клијентских веб апликација. Знање развоја клијентских веб апликација уз коришћење одговарајућих радних оквира и пратећих алата.",
                "sadrzaj": "Увод у програмски језик ЈаваСцрипт/ Прототипско објектно-орјентисано програмирање у језику ЈаваСцрипт/ Фирст-цласс функције и цлосуре у програмском језику ЈаваСцрипт/ Модуларизација ЈаваСцрипт апликација/ Патерни наслеђивања у програмском језику ЈаваСцрипт (псеудокласично, диференцијално и функционално)/ Дијалкти програмског језика ЈаваСцрипт/ Језици изведени из програмског језика ЈаваСцрипт и транспајлирање кода/ Архитектуре клијентских апликација/ Веб компоненте/ Анализа радних оквира за развој клијентских апликација/ Помоћни алати за развој клијентских апликација/ ЈаваСцрипт као језик за развој слоја пословне логике."
            },
            {
                "ime": "Mobilne aplikacije",
                "cilj": "Стицање општих знања и посебних вештина за разумевање концепата мобилног рачунарства. Овладавање технологијама и алатима за развој софтверских решења за мобилне рачунарске уређаје и системе.",
                "ishod": "Познавање технологија за програмирање мобилних апликација. Студент је компентентан да разуме концепте мобилног рачунарства и да развија софтверска решења за мобилне рачунарске системе.",
                "sadrzaj": "Преглед мобилног рачунарства. Хардвер мобилних уређаја. Комуникациони протоколи за мобилне уређаје. Програмски језици и оперативни системи за мобилне уређаје. Кориснички интерфејс у мобилним уређајима. Мултимедија у мобилним уређајима. Графика. Мрежни сервиси. Сервиси базирани на локацији. Рад са базама података. Безбедност у мобилним уређајима."
            },
            {
                "ime": "Računarstvo u oblaku",
                "cilj": "Упознавање студената са концептима рачунарства у облаку. Разумевања различитих врста сервиса рачунарства у облаку (ИааС, ПааС, СааС, ФааС, БПааС...) као и најпопуларнијим платформама за рачунарство у облаку (Амазон Wеб Сервицес, Гоогле Цлоуд Платформ, Азуре...). Упознавање са шаблонима за имплементацију решења у облаку. Мултицлоуд концепти и Фог цомпутинг.",
                "ishod": "Након успешно завршеног курса студент је у стању да примењује концепте и ресурсе који су доступни путем рачунарства уоблаку, као и да пројектује софтверске системе и апликације који користе платформе рачунарства у облаку.",
                "sadrzaj": "Појам рачунарства у облаку. Врсте сервиса: Инфраструктура као сервис (ИааС) и виртуализација, Платформа као сервис (ПааС), Софтвер као сервис (СааС), Функције као сервис (ФааС), Пословни процеси као сервис (БПааС) Популарне платформе за рачунарство у облаку. Шаблони при развоју система за рачунарство у облаку. Трендови развоја мултицлоуд палтформи и Фог цомуптинг."
            },
            {
                "ime": "Interakcija čovek računar",
                "cilj": "Оспособљавање студената за пројектовање и имплементацију основних носилаца интеракције човек рачунар.",
                "ishod": "Стечена знања и вештине су основа за развој софтвера што је могуће веће утилитарности у наредним курсевима и професионалном животу.",
                "sadrzaj": "HCI развој и проблеми. Развој интеракције оријентисан ка кориснику и уз његово активно учешће. Неопходна знања из когнитивне психологије, познате хеуристике и MVC/MVP/MVVM архитектуре. Сакупљање, интерпретација и анализа захтева. Спознавање корисника, задатка и контекста употребе. HCI нотације. Класе HCI прототипова и њихова еволуција у крајње решење. Алати за развој интерфејса. Пројектовање и простори: GUI, web, mobile, embedded, ubiquitous. Репрезентација и визуелизација. Интеракциони уређаји. Утилитарност интерфејса. Евалуација утилитарности."
            },
            {
                "ime": "Informaciona bezbednost",
                "cilj": "Оспособљавање студената за примену метода и техника за заштиту података.",
                "ishod": "Познавање метода и технологија за заштиту података. Студент је компентентан да користи криптографске методе и технологије, реализује софтвер за заштиту података у системима електронског пословања, пројектује и имплементира механизме за проверу идентитета и контролу приступа.",
                "sadrzaj": "Криптографија: преглед основних концепата, криптографски протоколи, алгоритми, дигитални потписи, дигитални сертификати. Симетрични и асиметрични криптографски алгоритми, хеш функције, размена кључева. Криптографски стандарди. PKI инфраструктура: управљање кључевима, успостављање PKI инфраструктуре, сертификациона тела, хијерархија сертифиакционих тела. Заштита XML докумената: дигитални потписи, шифровање, безбедност web сервиса. Технологија smart картица: организација, начин рада, стандарди, коришћење. Примена безбедносних концепата на нивоу оперативних система, база података и рачунарских мрежа. Провера идентитета: једнофакторска аутентификација, двофакторска аутентификација, лозинке, challenge-response принцип, напади, Kerberos, HTTP аутентификација. Контрола приступа: концепти, елементи, политика, механизми и модели контроле приступа. Моделовање претњи."
            },
            {
                "ime": "Računarska inteligencija",
                "cilj": "Овладавање основним принципима и техникама рачунарске (вештачке) интелигенције.",
                "ishod": "Разумевање основних принципа и техника рачунарске интелигенције и способност њихове примене у решавању различитих врста проблема.",
                "sadrzaj": "Концепти, циљеви, приступи, окружења и области примене рачунарске интелигенције. Слепе и хеуристичке претраге код проблема са и без противника. Моделовање стохастичких окружења (Марковљеви Процеси Одлучивања). Обучавање интелигентних агената помоћу учења условљавањем. Основе машинског учења: типови алгоритама и учења (надгледано, не-надгледано, полу-нагледано итд.), основе кластеровања и класификације. Увод у вештачке неуронске мреже (перцептрон и једноставне потпуно повезане мреже). Увод у дубоко учење: конволутивне неуронске мреже, рекурентне неуронске мреже, и принципи обучавања дубоких неуронских мрежа. Увод у дубоко учење условљавањем. Увод у програмски језик Пролог. Увод у генетске алгоритме."
            },
            {
                "ime": "Statistika",
                "cilj": "Оспособљавање студената на апстрактно мишљење и стицање основних знања из области Вероватноће и математичке статистике. Циљ предмета је да код студента развије посебан начин размишљања при проучавању масовних појава, посебно у области информатике. Карактер предмета је апликативни, стога се даје значај знањима која могу појаснити квантитативни приступ проблемима из области студирања. Уз то студенти се оспособљавају за коришћење статистичког програма. Циљ је оспособити студенте да знају одабрати одговарајуће статистичке методе, израдити статистичку анализу и суштински је образложити.",
                "ishod": "Стечена знања студент треба да користи у даљем образовању и у стручним предметима прави и решава математичке моделе користећи се сазнањима стеченим у овом предмету.",
                "sadrzaj": "Основне дефиниције у вероватноћи, условна вероватноћа и Бејсова формула. Случајна променљива непрекидног и дискретног типа , функција расподеле. Дводимензионална случајна променљива. Бројне карактеристике - очекивање, дисперзија, коваријанса, корелација. Граничне теореме. Појам популације и статистичког узорка, методе узорковања . Дескриптивна статистика, тачкасте и интервалне оцене параметара. Параметарске и непараметарске хипотезе и тестови значајности, интерпретација статистичких закључака. Регресиона анализа: линерана, нелинеарна и логистичка регресија. Визуализација статистичких података, дијаграми. Статистички модели у рачунарству. Овладавањем статистичким софтвером."
            },
            {
                "ime": "Stručna praksa - projekat",
                "cilj": "Стицање непосредних сазнања о функционисању и организацији предузећа и институција које се баве пословима у оквиру струке за коју се студент оспособљава и могућностима примене претходно стечених знања у пракси.",
                "ishod": "Оспособљавање студената за примену претходно стечених теоријских и стручних знања за решавање конкретних практичних инжењерских проблема у оквиру изабраног предузећа или инсититуције. Упознавање студената са делатностима изабраног предузећа или институције, начином пословања, управљањем и местом и улогом инжењера у њиховим организационим структурама.",
                "sadrzaj": "Формира се за сваког кандидата посебно, у договору са руководством предузећа или институције у којима се обавља стручна пракса, а у складу са потребама струке за коју се студент оспособљава."
            },
            {
                "ime": "Pisana i govorna komunikacija u tehnici",
                "cilj": "Оспособљавање студената за говорну и писану професионалну комуникацију. Током курса, студенти треба да овладају \"меким\" вештинама за ефикасну и успешну пословну комуникацију. Студенти такође треба да стекну вештине академског писања и презентовања. Кроз курс студенти треба да стекну и вештину претраге и позивања на адекватну научну и стручну литературу у циљу поткрепљивања поруке коју желе да пренесу.",
                "ishod": "Након успешно завршеног курса, студент је стекао вештину писане и оралне комуникације садржаја релевантних за инжењерску струку на српском и енглеском језику. Студент је стекао вештину да се јасно и концизно изражава, као и да поруку коју жели да пренесе поткрепи адекватном научном и стручном литературом. Студент је стекао вештине академског писања и презентовања, као и смернице за писање дипломског рада. Студент је такође стекао вештине професионалне комуникације путем различитих канала (електронска пошта, телефон,...).",
                "sadrzaj": "Структура и садржај семинарског, дипломског, мастер и научног рада; Елементи правописа и граматике српског и енглеског језика; Визуелна комуникација (изглед целокупног документа, начин презентације слика и табела у раду); Презентовање; Рад у алатима за обликовање текста (MS Word и LaTeX); Пословна кореспонденција (писање резимеа и извештаја; комуникација у тиму; комуникација путем различитих канала: електронска пошта, телефон, телеконференције); Елементи научног рада (претрага научне литературе, процес публикације рада, рецензирање и одговор на рецензије, цитирање стручне и научне литературе, вредновање часописа и конференција)"
            },
            {
                "ime": "Završni rad - istraživački rad",
                "cilj": "Примена основних, теоријско методолошких, научно-стручних и стручно-апликативних знања и метода на решавању конкретних проблема у оквиру изабране области. У оквиру овог дела завршног рада студент изучава проблем, његову структуру и сложеност и на основу спроведених анализа изводи закључке о могућим начинима његовог решавања. Проучавајући литературу студент се упознаје са методама које су намењене за решавање сличних задатака и инжењерском праксом у њиховом решавању. Циљ активности студената у оквиру овог дела израде дипломског рада огледа се у стицању неопходних искустава кроз решавања комплексних проблема и задатака и препознавање могућности за примену претходно стечених знања у пракси.",
                "ishod": "Оспособљавање студената да самостално примењују претходно стечена знања из различитих области које су претходно изучавали, ради сагледавања структуре задатог проблема и његовој системкој анализи у циљу извођењу закључака о могућим правцима његовог решавања. Кроз самостално коричћење литературе, студенти проширују знања из изабране области и проучавају различитих метода и радове који се односе на сличну проблематику. На тај начин, код студената се развија способност да спроводе анализе и идентификују проблеме у оквиру задате теме. Практичном применом стечених знања из различих области код стуедената се развија способност да сагледају место и улогу инжењера у изабраној области, потребу за сарадњом са другим струкама и тимским радом.",
                "sadrzaj": "Формира се појединачно у складу са потребама и облашћу која је обухваћена задатом темом завршног рада. Студент проучава стручну литературу, стручне и дипломске радове студената који се баве сличном тематиком, врши анализе у циљу изналажења решења конкретног задатка који је дефинисан задатком завршног рада."
            },
            {
                "ime": "Završni rad - izrada i odbrana",
                "cilj": "Циљ израде и одбране завршног рада је да студент покаже да поседује задовољавајућу способност примене теоријских и практичних знања у пракс",
                "ishod": "Израдом и одбраном завршног рада студенти који су завршили студије треба да буду способни да решавају реалне проблеме из праксе као и да наставе школовање уколико се за то определе. Компетенције укључују, пре свега, развој способности критичног мишљења, способности анализе проблема, синтезе решења, предвиђање понашања одабраног решења са јасном представом шта су добре а шта лоше стране одабраног решења. Свршени студенти имају и способност решавања конкретних проблема уз употребу научних метода и поступака. Посебно је важна способност повезивања основних знања из различитих области и њихова примена. Свршени студенти су оспособљени за интензивно коришћење информационо-комуникационих технологија. Свршени студенти овог нивоа студија поседују компетенцију за примену знања у пракси и праћење и примену новина у струци, као и за сарадњу са локалним социјалним и међународним окружењем.",
                "sadrzaj": "Формира се појединачно у складу са потребама и облашћу која је обухваћена задатом темом завршног рада. Студент у договору са ментором сачињава завршни рад у писменој форми у складу са предвиђеним стандардима Факултета техничких наука. Студент припрема и брани писмени завршни рад јавно у договору са ментором и у складу са предвиђеним стандардима. Студент проучава стручну литературу, стручне и дипломске радове студената који се баве сличном тематиком, врши анализе у циљу изналажења решења конкретног задатка који је дефинисан задатком завршног рада."
            }
        ],
        "Izborni strani jezik 1":[
            {
                "ime": "Енглески језик - основни",
                "cilj": "Овладавање основама енглеског језика:изговор енглеских гласова, усвајање вокабулара везаног за свакодневне ситуације, савладавање основа енглеске морфологије и синтаксе.",
                "ishod": "Студенти су способни да користе говорни и писани енглески језик у једноставнијим, свакодневним ситуацијама.",
                "sadrzaj": "Употреба члана, именица (множина именица), придеви (врсте, присвојни придеви, поређење придева), заменице (личне и присвојне), помоћни глаголи (be, do, have), модални глаголи. Употреба и грађење глаголских времена (Present Simple, Present Continuous, Present Perfect, Past Simple, Future forms). Упитни и одрични облик реченице. Вокабулар везан за свакодневне теме: упознавање, породица, слободно време, посао, храна и пиће, именовање и опис свакодневних предмета, опис људи и места и сл."
            },
            {
                "ime": "Енглески језик - средњи",
                "cilj": "Упознавање с основама енглеског језика у функцији струке за посебне намене. Обрађују се стручни и научни текстови из различитих области струке ради усвајања стручне терминологије сагласне с дефиницијама, класификацијама, терминима и појмовима усвојеним у савременим европским и светским стандардима. Проширује се знање енглеског језика проширивањем вокабулара, сложеница и употребе префикса и суфикса, и усвајају се граматичке и језичке конструкције карактеристичне за енглески језик у функцији струке за посебне намене.",
                "ishod": "Оспособљавање студената да на професионалном нивоу стекну довољно адекватног знања и вештине за једноставнију комуникацију на енглеском језику са клијентима, колегама и послодавцима.",
                "sadrzaj": "Одређени текстови из стручних техничких области. Систематизација времена, кондиционалне реченице, директан и индиректан говор, пасиви."
            },
            {
                "ime": "Енглески језик – виши",
                "cilj": "Усавршавање свих језичких вештина на високом нивоу. Развијање способности течне, прецизне и ефикасне комуникације о широком обиму тема и различитим ситуацијама. Проширује се знање енглеског језика проширивањем вокабулара, сложеница и употребе префикса и суфикса, и усвајају се софистициране граматичке и језичке конструкције карактеристичне за енглески језик на високом нивоу.",
                "ishod":"Оспособљавање студената да на високом нивоу поседују знања и вештине за комуникацију на енглеском језику у различитим ситуацијама користећи одговарајућу вокабулар, стил и тон комуникације.",
                "sadrzaj": "Систематизација и проширивање употребе глаголских времена, кондиционалне реченице, модални глаголи, фразални глаголи. Увежбавање функција као што су избегавање понављања, наглашавање и ублажавање израза, изражавање мишљена, слагање и неслагење, давање савета. Формални и неформални стил изражавање у говору и писању."
            }
        ],
        "Izborna pozicija 1":[
            {
                "ime": "Увод у инжењерску анимацију",
                "cilj": "Оспособљавање студената за израду компјутерских анимација, упознавање са основним појмовима и методама за генерисање анимације.",
                "ishod": "Да стечена знања примењују у даљем процесу образовања као и у будућем професионалном раду.",
                "sadrzaj": "Моделовање хијерархијске кинематике. Покретни сегменти, врсте зглобних веза. Симулације физичких ефеката. Амбијент. Бојење 3Д модела и рендеровање. Примена различитих апликативних софтвера.Скицирање: 3Д сцена. Скицирање као подлога за анимацију. Историја анимације и компјутерске анимације. Креативни развој анимације: припрема сценарија, анализа сцена и карактера, дизајн карактера, израда стратегије за продукцију, формирање тимова за техничко извођење анимације, монтажа сцена (слике и звука). Моделовање: простор, објекти и структуре. Трансформације, глобалне и локалне. Технике моделовања, криве, примитиви, површи. Геометрија фрактала, систем честица (particles), моделовање биљака, моделовање физичких карактеристика. Моделовање коже, длаке (косе) и одеће. Рендеровање: светла, камере и материјали. Колор модели, RGB, HSL. Различити модели рендеровања: Z-buffer, Ray Tracing. Осветлење и рефлексија.Сенчење: дифузно, спекуларно, Smooth, амбијентално, RenderMan senčenje. Мапирање слике, креирање мапе, мапе у реалном времену, позиционирање мапе, blending мапе. Рефлексија на површини."
            },
            {
                "ime": "Напредни алгоритми и структуре података",
                "cilj": "Упознавање студената са напредним структурама података и напредним алгоритмима. Оспособљавање студената да успешно изаберу погодне структуре и оптималне алгоритме за решавање сложених проблема и имплементирају решења ослањајући се на савремене програмске језике и технике програмирања",
                "ishod": "По успешном завршетку предмета студент је надоградио већ раније стечена знања из области структура података и алгоритама. Студент је у стању да користећи напредне структуре података и алгоритме ефикасније решава задатке и бира оне структуре и алгоритме који оптимизују извршавање постављених пробвлема и смањују општу временску сложеост решења. Избор ефикасних стратефија за комплекенсе структуре података је неопходан за израду брзих алгоритама, поготово у данас актуелним областима обраде великих количина података (Биг Дата) и умрежених података (граф-структура) и претраживању података.",
                "sadrzaj": "Hash табеле и принципи хеширања, структуре података за комбинаторну оптимизацију (heap, динамичка стабла, динамички гртафови), самоподешавајуће структуре (листе, самоподешавајућа стабла, листе са прескакањем), перзистентне и структуре отпорне на отказе. Напредни алгоритми, алгоритми погодни за умрежене и streming податке."
            }
        ],
        "Izborna pozicija 2":[
            {
                "ime": "Дизајн 3Д простора и окружења",
                "cilj": "Оспособљавање студената за дизајн имерсивних виртуалних простора и окружења у различитим дисциплинама. Знање које стичу омогућава им разумевање и примену основних правила просторне имерсије и утицаја дизајна простора на корсинике у видео играма, архитектури, градитељству, анимацји, медицини и многим другим областима.",
                "ishod": "Да стечена знања примењују у даљем процесу образовања као и у будућем професионалном раду.",
                "sadrzaj": "Увод у дефинисање основних начела дизајна имерсивних простора и њихове примене у различитим дисциплинама. Теорија и примена кроз историју развоја простора у архитектури и урбанизму и њихов утицај на развој виртуелних окружења. Рад са софтверима за 3Д моделоваје попут: Аутодеск 3дс Маx, СкетцхУп, Маyа, Блендер и други. Рад са алатима који раде у реалном времену (реалтиме) који служе за израду интерактивних визуализација: Унреал Енгине, Унитy и други."
            },
            {
                "ime": "Паралелно програмирање",
                "cilj": "Оспособљавање студената за паралелно програмирање паралелних рачунарских архитектура.",
                "ishod": "Оспособљеност за паралелно програмирање паралелних рачунарских архитектура применом шаблона, модела и алата за паралелно програмирање.",
                "sadrzaj": "Паралелни алгоритми (Анализа ефикасности алгоритама. Пројектовање паралелних алгоритама.) Паралелно програмирање (Шаблони паралелног програмирања. Модели паралелног програмирања Cilk и TBB. Алати за паралелно програмирање.) Паралелно програмирање са OpenCL (OpenCL модел паралелног програмирања. OpenCL модел конкурентног програмирања.) Структурно паралелно програмирање (Шаблони композиције. Шаблони структурне контроле тока. Шаблони руковања подацима. Други детерминистички шаблони. Недетерминистички шаблони.)"
            },
            {
                "ime": "Професионални портфолио запослених",
                "cilj": "Стицање знања у креирању професионалног портфолиа занимања запослених кроз интерактиван процес рада са саветником који помаже менаџерима и организацији у приказу професионалних циљева и постигнућа. Професионални портфолио укључује профил занимања и профил послодаваца на тржишту рада и представља механизам који подразумева цикличан процес професионалног напретка запослених. Циљ професионалног портфолиа је коришћење ресурса организације, као и властитих ресурса преко стандардног оквира, кроз континуирани процес усаглашавања профила занимања са профилом послодаваца. Портфолио обезбеђује препознатљивост на тржишту рада и ефикасније спровођење професионалних циљева, као и циљева организације.",
                "ishod": "Студенти ће бити оспособљени да: (1) дефинишу и креирају професионални портфолио занимања запослених (2) употребе портфолио за стварање нових идеја, занимања и понашања у сарадњи са супервизором (3) анализирају процес самоевалуације и евалуације организације (4) примене методе портфолиа за изградњу компетенција и професионалног идентитета (5) препознају адекватан профил послодавца (6) креирају порфолио послодавца;",
                "sadrzaj": "Професионални портфолио занимања: дефиниција, предмет и циљеви портфолиа; значај портфолиа занимања за савремене организације; портфолио дизајн; трендови у коришћењу професионалног портфолиа; Процес креирања портфолиа: карактеристике професионалног потрфолиа; идентификација, анализа и поређење различитих врста порфолиа послодаваца; структура професионалног портфолиа за менаџере;израда професионалног портфолиа помоћу саветника; одржавање портфолиа; Улога професионалног портфолиа: алат за самоевалуацију и евалуацију; портфолио регистар професионалних циљева и оспособљавање за реализацију акционог плана; унапређење професионалног статуса помоћу супервизијског програма са менаџерима; портфолио - средство конкурентске предности; комплетирање портфолиа у раду са саветником; бенефити ефективног саветодавног процеса за менаџере и организацију; Професионално саветовање у функцији професионалног портфолиа: улога професионалног саветовања и супервизије за континуирани прогрес запослених и организације; циљеви професионалног саветовања; стратегија професионалног саветовања; модели професионалног саветовања; бенефити саветовања за професионални раст."
            },
            {
                "ime": "Индустријска психологија",
                "cilj": "Образовни циљ: стицање знања из индустријске психологије у циљу хуманизације рада, развоја компетентности у пројектовању посла, процеса индустријализације запослених са циљем унапређења личних учинака и повећања пословне ефикасности и ефективности организације. Индустријска психологија указује на значај остваривања оптималног радног ефекта уз максимално прилагођавање човека раду.",
                "ishod": "Студенти ће бити оспособљени да: (1) примене практичне технике анализе посла, радних места запослених у организацијским улогама (2) идентификују индикаторе апсентизма и флуктуације (3) стекну знање о превентивним мерама повреда и несрећа на раду (4) анализирају функцију човека у техничким системима (5) усвоје принципе оптимизације рада, средстава за рад и услова радног места.",
                "sadrzaj": "Улога индустријске психологије у пословању: дефиниција, предмет и циљеви индустријске психологије; историјски развој; физиолошки и психолошки аспекти рада; циркадијални ритмови и индивидуалне разлике. Прилагођавање човека раду: методе прилагођавања човека раду; анализа посла-основа прилагођавања човека раду; методе процене радника и радних места; обликовање послова и организација рада; дизајн посла; улога апсентизма и флуктуације; радна адаптација. Радна способност запослених: технике редизајнирања посла; патологија рада; умор и монотонија; безбедност на раду; повреде на раду, превенција несреће на раду. Човек у савременим технолошким системима: систем човек-машина; ефикасност система; комуникација у систему; тачност, поузданост, расподела улога у систему; ментални модели оператора."
            }
        ],
        "Izborna pozicija 3": [
            {
                "ime": "Дистрибуирани системи у геоматици",
                "cilj": "Овладавање студента теоријским и практичним основама дистрибуираних система.",
                "ishod": "Стечена знања могу се користити у решавању конкретних инжењерских проблема, а такође предстваљају основу за даље праћење стручних предмета.",
                "sadrzaj": "Садржај предавања: • Дистрибуирани системи • Дистрибуција функција, ресурса и управљања • Концепција дистрибуираних база података • Дистрибуирани системи за управљање базама података • Основе пројектовања дистрибуције база података Садржај вежби: Практична примена, на предавањима, приказаних концепата"
            },
            {
                "ime": "Софтвер надзорно-управљачких система",
                "cilj": "Циљ предмета је стицање неопходних знања о софтверу надзорно управљачких система.",
                "ishod": "Исходи су овладавање знањима, вештинама и способностима потребним за разумевање сложености софтвера надзорно-управљачких система, као и решавање конкретних инжењерских проблема.",
                "sadrzaj": "Увод у надзорно-управљачке системе; Примери надзорно-управљачких система; Архитектуре надзорно-управљачких система; Протоколи и софтвер за прикупљање података из индустријских система; Реал-тиме базе података; Софтверске компоненте за чување и обраду аларма и догађаја; Историјски подаци СЦАДА система; Софтвер корисичког интерфејса; Софтверске компоненте подсистема за: рецептуре, извештавање, симулацијоне и оптимизационе прорачуне; Софтверске компоненте за интеграцију са пословним подсистемима; Мобилне апликације у надзорно-управљачким системима; Поузданост и доступност система; Безбедност СЦАДА система."
            }
        ],
        "izborna pozicija 4": [
            {
                "ime": "Напредне технике програмирања",
                "cilj": "Упознавање студената са напредним техникама програмирања и савладавање основних теоријских знања и техника. Оспособљавање студената за анализу и примену адекватне методологије програмирања за постављени задатак и уочавање предности и мана различитих методологија.",
                "ishod": "По окончању предмета студенти су способни да разумеју различите методологије програмирања, терминологију из ове области, анализирају и примене адекватне методологије и технике за постављен задатак и критички евалуирају решење и наведу предности и недостатке. Такође су оспособљени за практичну употребу одређених техника и алата у домену напредних методологија програмирања.",
                "sadrzaj": "Теоријска настава: методологије и модели програмирања: објектно-оријентисано, императивно, деларативно, програмирање оријентисано ка процесима, функционално, конкурентно, програмирање вођено догађајима (event-driven programming), кориснички оријентисано (end-user programming). Технике и појмови: итератори, генератори, корутине, mixins, лења евалуација, прототипи, мета-програмирање, систем типова. Функционално програмирање: ламбда цалцулус, непромењивост (immutability), пропратни ефекти (side-effects), функције вишег реда, рекурзија;алгоритми за обраду великих количина податка – (map-reduce); функционални програмски језици (Lisp, Scheme, Clojure, Haskel, Erlang). Програмирање оријентисано ка аспектима (Aspect-Oriented Programming – AOP). Скрипт језици и динамичко програмирање. Програмски језици са више парадигми (multi-paradigm) - Python/Jython, Java, Scala, C++. Употреба и комбиновање више програмских језика (language polyglotism): механизми интеграције, интеграционе платформе, конверзије типова, алати. Практична настава: обука за коришћење и практичну примену програмских језика, техника и алата базираних на различитим методологијама и програмским моделима. Примена наученог у имплементацији пројектог задатка уз употребу различитих програмских језика, техника и алата и интеграција програмског кода у јединствено решење."
            },
            {
                "ime": "Међурачунарске комуникације и рачунарске мреже 1",
                "cilj": "Оспособљавање за пројектовање, реализацију и тестирање комуникационих протокола и овладавање основама TCP/IP Интернет технологије.",
                "ishod": "Оспособљеност за пројектовање, реализацију и тестирање комуникационих протокола и владање основама TCP/IP Интернет технологије.",
                "sadrzaj": "Увод. Пројектовање протокола (појам протокола, језици за форману спецификацију протокола – SDL, MSC, TTCN, UML). Методологија реализације протокола (језгро, пројектантски шаблон, библиотека класа за реализацију протокола). Протоколи за управљање у Интернету. Увод у заштиту рачунарских мрежа. Пренос аудио и видео података у Интернету."
            },
            {
                "ime": "Базе података 2",
                "cilj": "Овладавање техникама и методама пројектовања база података и напредним техникама имплементације, коришћења и одржавања база података.",
                "ishod": "Студенти стичу напредна знања из области пројектовања база података, која се, даље, користе у пракси и стручним предметима Пројектовање софтвера, Инжењеринг информационих система, Пословна информатика и Системи база података.",
                "sadrzaj": "Функционалне зависности и алгоритми за генерисање кључева шема релација. Вишезначне зависности и зависности споја. Нормалне форме и пројектантски критеријуми структурирања релационе шеме базе података. Метода декомпозиције. Метода синтезе. Превођење ER шема база података у релациони модел података. Методолошки приступи пројектовању шема база података. CASE алати за пројектовање шема база података."
            }
        ],
        "izborna pozicija 5": [
            {
                "ime": "Напредне веб технологије",
                "cilj": "Проширење знања које су студент стекли на предмету wеб програмирање; Упознавање студената са концептима, структуром и начинима развоја модерних “богатих” интернет апликација (Rich Internet Applications – RIA).",
                "ishod": "Након успешно завршеног курса студент познаје концепте израде напредних wеб апликација, коришћењем нових технологија које побољшавају корисничко искуство, као и методе прилагођавања садржаја wеб апликација различитим излазним уређајима.",
                "sadrzaj": "Основни концепти развоја корисничког интерфејса за wеб апликације (функционалност, поузданост, доступност, стандардизација) – XHTML, HTML5, DOM; Принципи развоја “богатих” wеб апликација (RIA) - побољшање корисничког искуства (конзистентност, универзална употребљивост, приказ повратних информација, коначност операција, спречавање/отклањање грешака, лак опозив акција, препуштање контроле кориснику, смањење когнитивног оптерећења корисника); Употреба CSS2 и CSS3 стандарда за визуелизацију садржаја, Интерактивност у wеб апликацијама – обрада догађаја на клијентској и серверској страни, асинхрона комуникација (REST, AJAX); Употреба JavaScript библиотека за развој RIA - jQuery, jQueryUI, ExtJS; Алтернативне репрезентације података - XML, JSON; Проблеми сигурности wеб апликација (XSS, CSRF, SQL Injection); Коришћење Wеб сервиса за развој RIA; Прилагођавање wеб апликација мобилним платформама – концепт адаптивног дизајна wеб апликација (респонсиве десигн) насупрот концепту развоја засебних верзија за различлите платформе; Основе система за управљање садржајем (Content Management Systems)."
            },
            {
                "ime": "Алгоритми дигиталне обраде звука",
                "cilj": "Овладавање студената алгоритмима и њиховом програмским реализацијама на процесорима са структуром карактеристицном за дигиталне процесоре сигнала.",
                "ishod": "Усвајање појмова и поступака карактеристицних за алгоритме и структуре дигиталне обраде сигнала.",
                "sadrzaj": "Увод у алгоритме и структуре дигиталне обраде сигнала. А/Д и Д/А конверзија. Програмска подршка трансформације дискретних сигнала. Програмска подршка за пројектовање ФИР филтара. Програмска подршка за пројектовање ИИР филтара. Програмска подршка дигиталних филтара. Програмска подршка адаптивних дигиталних филтара. Програмска подршка за дигиталну обраду сигнала са више брзина."
            }
        ],
        "izborna pozicija 6": [
            {
                "ime": "Инжењерство софтвера за Internet/Web of Things",
                "cilj": "Оспособљавање студената за програмирање Web of Things (WoT) апликација и система на најразличитијим уређајима и платформама које користе Интернет технологије и веб протоколе за међусобну комуникацију. Овакве апликације ће моћи да се примене у пројектима као што су: паметне куће, паметне учионице, паметни градови, побољшање услова у саобраћају, е-здравство, повећање регуларности у спорту, поједностављена трговина, модерна и ефикасна пољопривреда.",
                "ishod": "Методе, технологије и стандарди за развојWoT апликација.",
                "sadrzaj": "Основе Internet of Things и Web of Things концепата, парадигма и технологија. Издрада мини апликација и упознавање са принципима платформа као што су нпр. Arduino и Rapsberry PI. Представљање теоријских основа : сензора, актуатора, уређаја за комуникацију, микроконтролера и протокола за комуникацију (ХТТП). Преглед и примена РЕСТ АПИ, комплексне СОА архитектуре."
            },
            {
                "ime": "Напредно C програмирање у реалном времену",
                "cilj": "Циљ предмета је да се код студената развије разумевање односа и зависности софтвера и хардвера кроз механизме програмској језика Це. Намера је да се студенти оспособе за самосталан и дисциплинован развој програма у програмском језику Це, са дубинским разумевањем кода.",
                "ishod": "Након положеног предмета очекује се да студенти буду способни да пројектују и реализују програме средње сложености и индустријског квалитета у језику Це за разноврсне циљне платформе.",
                "sadrzaj": "Задаци програма који се ослањају на процесорску архитектуру и њихове посебности. Контролисано извршавање програма и улога симулатора. Дубље упознавање са неким елементима програмског језика Це: величина и репрезентација основних типова; променљиве и њихова представа у физичкој архитектури; механизми заузимања меморије; функције и позивна конвенција; показивачи и њихов однос са низовима; мала и велика крајност (енгл. ендиан); структуре, уније и адресно поравнање; билд процес и претпроцесор. Системи за контролу верзија. Основне структуре података које су честе код програма за наменске системе. Наменска проширења Це језика: допунски стандарди и компајлерске посебности. Теме везане за безбедност и поузданост програма: технике испитивања, МИСРА (и слична) правила и статичка анализа кода."
            },
            {
                "ime": "Програмски преводиоци",
                "cilj": "Упознавање студената са принципима рада компајлера, концептима превођења са једног програмског језика на други, алатима за њихово прављење и начином њихове имплементације. Овладавање прављењем компајлера на почетничком нивоу.",
                "ishod": "Након успешно завршеног курса студент познаје принципе рада компајлера; познаје фазе компајлирања; користи технике превођења са једног језика на други; рукује алатима за генерисање компајлера и прави скенере, парсере и једноставне компајлере.",
                "sadrzaj": "Задатак компајлера: фазе компајлирања; Врсте програмских језика и компајлера: ЛЛ и ЛР компајлери, топ доwн и боттом уп компајлери; Формални језици: граматике, БНФ и аутомати; Лексичка анализа: генератор скенера, регуларни изрази; Синтаксна анализа: теорија парсирања, генератор парсера, руковање грешкама; Управљање меморијом и табела симбола: организација меморије, имплементација табеле симбола, опсег видљивости; Типови: механизам типова и провера типова; Семантичка анализа: опис и анализа семантике програмског кода; Врсте и репрезентација међукода: синтаксно стабло, постфиксна нотација, троадресни код; Генерисање кода; Оптимизација (међу)кода: основне врсте анализе програма и оптимизације; Интерпретери и интерпретација међукода."
            }
        ],
        "izborna pozicija 7": [
            {
                "ime": "Симулације у анимацији",
                "cilj": "Оспособљавање студената за примену 3Д компјутерске симулације у различитим дисциплинама. Оспособљавање студената за разумевање улоге и значаја симулације приликом ситуационих тренинга у едукацији и војсци, за процену ризика и анализе простора у архитектури, урбанизму, грађевини, видео играма, психологији и другим дисциплинама.",
                "ishod": "Да студенти стечена знања примењују у даљем процесу образовања као и у будућем професионалном раду.",
                "sadrzaj": "Увод и дефинисање појма 3Д симулације, њеног развоја кроз историју и значаја за науку, едукацију, војну технологију, медицину, архитектуру, урбано планирање, развој видео игара и других. Основни принципи утицаја дизајна грађеног и виртуелног простора на људско понашање. Теорија и примена симулација у анализи 3Д простора: примена ЦФД (Цомпутатионал Флуид Дyнамицс) софтвера за анализу и процену ризика у раној фази дизајнирања морфологије простора и објеката; анализа дневне осветљености (Радианце, Ецотецт) и њеног утицаја на кориснике; подешавање сцене за интеракцију са 3Д простором и симулација ситуационих тренинга у видео играма и други."
            },
            {
                "ime": "Рачунарска графика",
                "cilj": "Оспособљавање студената за развој и манипулацију елементима рачунарске графике у простору.",
                "ishod": "Стечена знања и вештине користе се за развој софтвера специфичне визуелизације информација употребом DirectX и/или OpenGL, дигитализацију и обраду графичког материјала - Photoshop, CorelDraw и Matlab.",
                "sadrzaj": "Основни појмови. Хардверска и софтверска архитектура (OpenGL, DirectX, X3D) графичких рачунарских система. Увод у 3D graphics pipeline. Технике 3Д моделовања и алгоритми за model/view трансформацију. Теорија боја. Моделовање локалне илуминације и сенчења. Клипинг. Пројекција. Растеризација. Уклањање невидљивих линија/површина. Превлачење текстуре и ефекти. Глобална илуминација. Графички кориснички интерфејс и уређаји."
            },
            {
                "ime": "Аутомобилски софтвер",
                "cilj": "Оспособљавање студената за пројектовање и програмирање аутомобилског софтвера.",
                "ishod": "Оспособљеност за пројектовање и програмирање аутомобилског софтвера, са акцентом на формалним методама у пројектовању и коришћењу стандардизованих програмских технологија у програмирању аутомобилског софтвера.",
                "sadrzaj": "Увод. Пројектовање аутомобилског софтвера (Основе модерног аутомобила. Архитектура система. Развој софтвера заснован на моделима. Формалне методе. Временски аутомати. Алат UPPAAL. Примери модела у формализму временских аутомата. Провера својстава модела. Окружења за моделовање софтвера. UML. GME.). Програмирање аутомобилског софтвера (Програмирање аутомобилских апликација на OS RTEMS i WxWorks. Аутоматско генерисање софтвера из модела.). Тестирање аутомобилског софтвера (Модел коришћења софтвера. Алат MaTeLo. Аутоматско генерисање тест случаја. Процена поузданости софтвера. Тестирање континуалних система.)."
            }
        ],
        "izborna pozicija 8": [
            {
                "ime": "Софт компјутинг",
                "cilj": "Овладавање студената концептима, техникама и одабраним примерима примена софт компјутинга. Студент би требало да уме да идентификује реалне ситуације у којима је употреба техника софт компјутинга адекватна и да примени одговарајуће технике за решавање ових проблема. Фокус предмета је и на примени техника софт компјутинга за обраду и процесирање комплексних података попут слике и звука.",
                "ishod": "Након успешно завршеног курса, студент је стекао знање које представља основу за решавање сложених проблема који захтевају интелигенцију и не могу се решавати применом конвенционалних математичких приступа. У оквиру курса студент, стиче знање о основама машинског учења и основним проблемима који се јављају у овој области. Посебан фокус курса је на оспособљавању студента да овлада техникама обраде и репрезентације сложених података (слике и звука) у облику погодном за даљу обраду методама машинског учења.",
                "sadrzaj": "(1) Основе машинског учења: основни појмови и проблеми; основни модели; евалуација модела. (2) Неуронске мреже: основни модел и основне архитектуре; конволуционе неуронске мреже (архитектуре конволуционих неуронских мрежа, визуелизација обележја, софтвер за дубоко учење) (3) Рад са сликама: кластеровање (алгоритам к-средина, метрике растојања - мека поређења текста, слика и осталих објеката, примена кластеровања на сегментацију слике); Претпроцесирање и екстракција обележја са дигиталне слике (једноставне операције - сабирање, одузимање, афине трансформације, хистограм, морфолошке операције и конволуција; детекција ивица; Hough трансформација); Препознавање објеката на сликама (класичан приступ - екстракција обележја која се прослеђују моделу машинског учења; примена конволуционих неуронских мрежа у детекцији објеката) (4) Рад са звуком: Фуријеова трансформација."
            },
            {
                "ime": "Оперативни системи за рад у реалном времену",
                "cilj": "Оспособљавање студената за пројектовање и програмирање системског софтвера за рад у реалном времену, са акцентом на оперативне системе за рад у реалном времену и сложене апликације за рад у реалном времену.",
                "ishod": "Оспособљеност за пројектовање и програмирање системског софтвера за рад у реалном времену, са акцентом на оперативне системе за рад у реалном времену и сложене апликације за рад у реалном времену са деловима у системском и корисничком адресном простору.",
                "sadrzaj": "Увод. Пројектовање оперативних система у реалном времену (Развој и класификација оперативних система. Концепт процеса.). Руковање ресурсима. Руковање процесором (Алгоритми планирања процеса. Међусобно блокирање процеса. Временски побуђена програмска подршка. Анализа распоредивости задатака. Алати Timestool и Cheddar). Руковање меморијом (Додела меморије у мултипрограмским условима. Виртуелна меморија.). Руковање улазо-излазом (Улазно-излазне јединице. Прекиди и У-И процеси. Независност програма од У-И јединица. Руковаоци уређајима.). Руковање информацијама (Систем датотека. Операције. Методи приступа датотеци. Баферисање. Хијерархијски модел система.). Примери оперативних система за рад у реалном времену (Мултитаскинг. RTlinux. RTEMS.). Примери апликације за рад у реалном времену (Телефонска централа. Рачунарске игре.)."
            },
            {
                "ime": "Софтвер у дигиталној телевизији 1",
                "cilj": "Курс обезбеђује фундаментална знања из области телевизије и преноса те репродукције мултимедијалног садржаја до корисника. Обрађују се технологије емитерске телевизије у оквиру стандарда ДВБ, са нагласком на архитектуру и пројектовање софтвера за дигиталне ТВ пријемнике.",
                "ishod": "Након успешног завршетка овог курса, студенти ће бити у могућности да пројектују софтвер за уређаје који примају и репродукују мултимедијални садржај, са нагласком на видео садржају. Такође, студенти ће савладати методе и технике видео кодовања, као и системе и технике за заштиту видео садржаја. У оквиру практичног рада студенти развијају софтвер за реални сет-топ бокс у складу са стандардом ДВБ-Т2. Кроз развој реалистичне апликације дигиталне телевизије, студенти ће у потпуности разумети све фазе емитовања, као и решења за репродукцију садржаја и контролу обраде свих компоненти мултимедијалног садржаја, укључујући аудио, видео и графику на екрану.",
                "sadrzaj": "Први део: Основе телевизије; Технике преноса сигнала; Телевизијски сигнал; ТВ стандарди и формати у телевизији. Други део: Увод у дигиталну телевизију; Развој дигиталне телевизије; Основне предности и недостаци дигиталног преноса; Технике дигиталног емитовања и пријема; Преглед техника дигиталне модулације; Преносни ток; Стандарди у дигиталној телевизији. Трећи део: Основни стандарди у ДВБ; Основни појмови у ДВБ-Т2; Синхронизација и метаподаци; Сигналне табеле; Четврти део: Архитектура дигиталног ТВ пријемника; Улазни степен; Процесор преносног тока; Декодер; Графички подсистем; Излазни интерфејси; Комуникација између интегрисаних кола; Рутирање сигнала; Сценарији репродукције; Пети део: Софтвер дигиталног ТВ пријемника; Софтверски модел ТВ пријемника; Архитектура ТВ апликације и дизајн шаблони; Случајеви употребе у ДТВ апликацијама; Шести део: Видео кодовање и актуелни стандарди; Временски и просторни модел; Преглед стандарда видео кодовања; Профили и нивои; Најновији стандарди; Седми део: Системи за контролу приступа садржају; Архитектура система; Условни приступ у ДВБ; Скрембловање; Сигнализација; Елементи безбедности у хардверу и софтверу; Осми део: Интеграција система и практични аспекти; Компоненте ДТВ система и произвођачи; Техничка документација; Нивои интеграције и праксе интеграције софтвера; Развој реалне ДТВ апликације кроз практичан рад."
            },
            {
                "ime": "Архитектуре и методе пројектовања безбедносно критичног софтвера у аутомобилској индустрији",
                "cilj": "Циљ предмета је оспособљавање студената за разумевање и пројектовање архитектуре и самог безбедносно критицног софтвера за аутомобилску индустрију, као и овладавање основним концептима и стандардима потребним за разумевање безбедностих аспеката у аутомобилској индустрији.",
                "ishod": "Након положеног предмета очекује се да студенти буду способни да разумеју архитектуру и методе за пројектовање безбедносно критичног софтвера у аутомобилској индустири и да пишу једноставне програме који раде у таквом окружењу.",
                "sadrzaj": "1. Увод: развој модуларног софтвера базираног на компонентама, преглед процеса развоја у аутомобилској индустрији (од захтева до тестирања) 2. Основе АУТОСАР стандарда: концепти, архитектура, методологија, градивни елементи а. РТЕ(енг. Рунтиме Енвиронмент) - извршно окружење, б. БСW (енг. Басиц Софтwаре Цомпонентс) - основни софтверски модули, ц. СWЦ (енг. Софтwаре Цомпонентс) - апликативни софтверски модули д. ВФБ (енг. Виртуал Фунцтионал Бус) - виртуелна функционална магистрала 3. АУТОСАР: начини миграције са старијих аутомобилских архитектура 4. АУТОСАР-практична разматрања: а. Оперативни систем, б. Софвтерске компоненте, ц. Комуникација, д. Руковање улазно/излазних уређаја, е. Машина стања, ф. Системски сервиси и руковање меморијом, г. Дијагностички модули. 5. Основе развоја функционално безбедног аутомобилског софтвера са нагласком на ИСО 26262 стандард и основне захтеве: а. руковођење безбедносним процесима, б. развој безбедносног концепта, ц. развој безбедног система."
            }
        ],
        "izborna pozicija 9": [
            {
                "ime": "Развој софтвера вођен моделима",
                "cilj": "Упознавање студената са различитим правцима из области развоја софтвера вођеног моделима (Модел Дривен Енгинееринг – МДЕ), у циљу овладавања методама, техникама, стандардима и алатима који могу значајно допринети ефикаснијем развоју квалитетног софтвера.",
                "ishod": "Након успешно завршеног курса студент је у стању да: (1) идентификује предности и мане различитих МДЕ праваца, (2) идентификује постојеће МДЕ ресурсе (стандарде, библиотеке, језике, алате) који му могу послужити као подлога за развој сопственог МДЕ решења, (3) пројектује и имплементира МДЕ решење за неку конкретну намену, (4) практично примени стечена знања у реалним ситуацијама, (5) самостално проширује знање из области, на основу подлоге коју је стекао на овом предмету.",
                "sadrzaj": "Увод у МДЕ (Модел Дривен Енгинееринг). Увод у МДА (Модел Дривен Арцхитецтуре). УМЛ 2 као подлога за МДА. ОЦЛ (Објецт Цонстраинт Лангуаге). Трансформације. Моделовање специфично за домен. Имплементација ДСЛ решења. Извршиви УМЛ. Пројектовање и имплементација МДЕ решења за изабрани домен."
            },
            {
                "ime": "Машинско учење",
                "cilj": "Овладавање основним концептима, елементима и техникама из домена машинског учења. Оспособљавање студента да разуме основне моделе машинског учења, као и теорије која стоји иза њих. Оспособљавање студента да за реалан проблем машинског учења препозна тип проблема и практично примени адекватне алгоритме.",
                "ishod": "Након успешно завршеног курса, студент зна: да дефинише и разликује основне проблеме у машинском учењу (регресију, класификацију, кластеровање и редукцију димензионалности); који алгоритми и модели су адекватни за решавање сваког од основних проблема; теорију иза модела машинског учења; практичне импликације неопходне за имплементацију датих модела; да дизајнира валидан експеримент којим може да упореди перформансе различитих модела; да примени стечено знање на реалне проблеме.",
                "sadrzaj": "(1) Надгледано обучавање: Линеарна регресија (једнострука и вишеструка регресија, метод градијентног спуста и његове варијанте, аналитичко решење у затвореној форми, утицај outlier-а); Непараметарски приступ (метод к најближих суседа и крернел регресија); Метод максималне веродостојности; Класификација (логистичка регресија, перцептрон, наивни Бајес, метод потпорних вектора, ансамбли класификатора). (2) Правилан дизајн експеримената и селекција оптималног модела: адекватне мере перформансе за различите проблеме; експериментални поступци (унакрсна валидација, подела на тренинг/валидациони/тест скуп, адекватна селекција и оптимизација модела); преприлагођавање и регуларизација (гребена регресија, ласо регресија, еластична мрежа и њихово поређење). (3) Полу-надгледано обучавање (преглед основних концепата и алгоритама). (4) Ненадгледано обучавање: кластеровање (алгоритам к-средина и модел Гаусових мешавина); редукција димензионалности (анализа главних компоненти). (5) Практични савети за примену алгоритама машинског учења. (6) Теорија учења: Hoeffdingova неједнакост; Вапник-Червоненкинсова димензија; Нагодба апроксимације и генерализације."
            },
            {
                "ime": "Архитектуре и алгоритми ДСП-а",
                "cilj": "Овладавање пројектовањем алгоритама са акцентом на њихову имплементацију и прогамирање дигиталних сигнал процесора. Обрађују се хардверска проширења дигиталних сигнал процесора, као и специфицности развоја софтвера за овакве платформе",
                "ishod": "Владање основним техникама програмирања дигиталних сигнал процесора. Пројектовање, реализација, оптимизација, профилисање и испитивање једноставних алгоритмана за дигиталну обраду сигнала у реалном времену на симулатору као и на физичкој платформи.",
                "sadrzaj": "Увод у дигиталне сигнал процесоре. Архитектура процесора за дигиталну обраду сигнала (Вон Неуман-ова, Харвард архитектура, РИСЦ и ДСП, проточна архитектура). ДСП ресурси: АЛУ, МАЦ, меморија, спрежни системи. Формат података. Специфичности софтвера за ДСП, помоћна програмска подршка, алати и интегрисана окружења. Методе развоја софтвера за наменске платформе. Програмирање ДСП-а: рад у реалном времену, програмски језици (Ц и асемблер), програмски алати, оперативни системи и радна окружења, рад са симулатором и развојном плочом, методе испитивања софтвера, методе оптимизације софтвера."
            }
        ],
        "izborna pozicija 10":[
            {
                "ime": "Развој безбедног софтвера",
                "cilj": "Оспособљавање студената за примену техника за дизајнирање, имплементацију и тестирање безбедносних аспеката софтверских система.",
                "ishod": "Након успешно завршеног курса, студенти су стекли теоријска и практична знања о инжењерингу безбедног софтвера, укључујући разумевање безбедносних претњи, напада који реализују претње и метода за спречавање напада. Студенти су у стању да дизајнирају безбедне архитектуре софтвера, имплементирају код без рањивости и тестирају софтвер да верификују његову безбедност, резултујући у конструкцији безбедног софтвера.",
                "sadrzaj": "Увод у инжењеринг безбедног софтвера: дефиниција (предмет интересовања), основни појмови, безбедносни захтеви. Анализа токова података: анализа граница поверења, минимизација токова података, анализа и редукција површине за напад. Моделовање претњи: поглед ресурса, поглед нападача, поглед софтвера. Безбедносни дизајн: принципи безбедног дизајна, шаблони безбедног дизајна, вишеслојна заштита. Веб безбедност: претње, напади, рањивости, митигације. Безбедност управљаног кода: претње, напади, рањивости, митигације. Безбедност ентерприсе система: претње, напади, рањивости, митигације. Безбедносно тестирање: тестирање безбедносних захтева, тестирање митигација, алати за безбедносно тестирање, пенетрационо тестирање. Безбедна софтверска солуција: безбедна поставка софтвера, периферни безбедносни алати, безбедно оперисање софтвера."
            },
            {
                "ime": "Софтверски агенти",
                "cilj": "Оспособљавање студената за решавање проблема из области агентских технологија.",
                "ishod": "Познавање технологија дистрибуираних софтверских компоненти које испољавају својства софтверских агената. Студент је компентентан да користи технологије дистрибуираних софтверских компоненти да изгради агентско окружење и софтверске агенте.",
                "sadrzaj": "Основи појмови из агентске технологије. Агентска окружења и софтверски агенти. Животни циклус агената. Аутономија. Комуникација. Реакција. Проактивност. Мобилност агената. Сервиси. Директоријуми агената и сервиса. Сигурност. Организација агентских окружења у рачунарским мрежама."
            },
            {
                "ime": "Микропроцесорски управљачки уређаји",
                "cilj": "Стицање основних знања о микропроцесорским управљачким уређајима.",
                "ishod": "Стицање теоријских и практичних знања о микропроцесорским управљачким уређајима.",
                "sadrzaj": "Основе микропроцесора и микроконтролера. Меморије и DMA контролери. Периферије микрорачунарских уређаја. Обрада временски критичних догађаја (прекиди, брзи улази и излази, тајмери/бројачи). Комуникациони контролери: UART, I2C, SPI. Дисплеји и тастатуре. Галванска изолација дискретних и аналогних улаза и излаза. Електромагнетска компатибилност и заштита. Примери архитектуре PLC уређаја. Примери архитектуре индустријских регулатора. Индустријски комуникациони интерфејси: RS485, RS422, PROFIBUS, MODBUS, CANBUS."
            },
            {
                "ime": "Принципи дигиталне обраде слике за аутономна возила",
                "cilj": "Упознати студенте са значајем АДАС система. Упознати студенте са значајем дигиталних слика и видео сигнала те системом камера у возилима. Оспособити студенте за примену и развој напредних алгоритама за обраду дигиталних слика и видео сигнала, с нагласком на алгоритмима за примену у аутономним возилима.",
                "ishod": "Након успешног завршетка курса, студенти ће бити способни да: 1. вреднују важности АДАС система 2. упореде алгоритме за обраду слике и видео сигнала у аутономним возилима 3. примене напредне алгоритме обраде слике и видеа у реалном времену 4. вреднују карактеристике система камера за аутономну вожњу 5. примене поступке обраде слике камере за замену огледала 6. развију прототип властитог алгоритма обраде слике и видеа у реалном времену за примену у аутономним возилима",
                "sadrzaj": "Увод у АДАС (Адванцед Дривер Ассистанце Сyстемс). Карактеристике дигиталне слике и видеа. Напредни алгоритми за обраду слике и видеа у реалном времену који се користе у аутономним возилима. Обрада слике: поступци компресије, методе побољшања слике, детекција рубова, детекција, класификација и препознавање објеката, сегментација сцене, оптичко препознавање знакова. Видео: видео стандарди, 3 Д реконструкција сцене, временско праћење објеката, стереовизија, детекција пешака применом камера. Системи камера у возилима. Примена камере као замене за огледала."
            },
            {
                "ime": "Системи база података",
                "cilj": "Напредно образовање студената у области база података (БП), са могућношћу брзог укључивања у реалне пројекте из области развоја система БП и информационих система.",
                "ishod": "Стицање вештина и знања, неопходних за примену специјалних техника пројектовања БП. Упознавање нових модела података и специјализованих примена система база података. Савладавање техника програмирања на нивоу сервера БП.",
                "sadrzaj": "Заједнички концепти и пожељне карактеристике модела података. Класификација и врсте ограничења модела података. Формална спецификација ограничења БП. Напредне могућности језика SQL у опису шеме базе података и манипулацији подацима. Технике серверског програмирања (програмирања на нивоу СУБП). Технике аутоматизованог пројектовања и интеграције шеме БП. Обезбеђење приступа систему базе података. Објектно-оријентисане и објектно-релационе базе података. XML базе података. Темпоралне базе података. Дистрибуиране базе података."
            }
        ],
        "izborna pozicija 11":[
            {
                "ime": "Пословна информатика",
                "cilj": "Оспособити студенте за самосталну анализу и моделовање пословних система, моделовање шеме базе и архитектуре софтвера пословних система, имплементацију стандарда визуалних и функционалних картактеристика пословних апликација, документовање и презентацију решења из домена пословне информатике. Оспособити студенте за тимски рад везан за инжењеринг и реинжењеринг пословних информационих система уз ослонац на савремене информационе технологије и методологије пројектовања.",
                "ishod": "По успешном полагању испита студент стиче знања везана за организацију и функционисање пословних система, анализу пословних система, моделовање пословне логике, моделовање података пословних система, моделовања софтвера пословних система, имплементацију подсистема као и практично искуство у тимском раду на реализацији одабраног пословног система/подсистема. По успешном полагању испита студент је оспособљен за самостално пројектовање пословних информационих система у свим фазама животног циклуса, примену стандарда у моделовању и пројектовању пословних информационих система и стандардизацију визуалних и функционалних карактеристика софтвера пословних информационих система.",
                "sadrzaj": "Појам и врсте пословних система. Организациона структура и нивои организације пословних система. Моделовање пословне логике. Објектно моделовање пословних система. Основи пословне информатике. Хијерархија пословних информационих система. Подсистеми пословних информационих система. Стандарди пословних апликација. Методе имплементације пословних информационих система. Енкапсулација пословних информационих система. Управљање пројектом развоја пословних информационих система. Реинжењеринг и реверзно инжењерство пословних информационих система."
            },
            {
                "ime": "Системи базирани на знању",
                "cilj": "Овладавање студената концептима, техникама и одабраним примерима примена система базираних на знању.",
                "ishod": "Стечена знања омогућују пројектовање и имплементацију система базираних на знању и њихову примену.",
                "sadrzaj": "Структура система базираних на знању. Репрезентација знања. Расуђивање и закњучивање. Дизајн система базираних на знању. Имплементација система базираних на знању. Софтверски алати за изградњу система базираних на знању. Примене система базираних на знању."
            },
            {
                "ime": "Инжењеринг информационих система",
                "cilj": "Стицање општих знања и специфичних вештина за разумевања значаја, суштине, прилаза у развоју и процеса организовања пословних система, као и примену основних менаџерских техника у управљању тим системима. Овладавање методама развоја информационих система и управљања процесом њиховог развоја. Примена CASE алата у процесу развоја информационих система. Разумевање улоге информационих система у унапређењу пословања организационих система. Разумевање CMMI, као једног приступа унапређењу пословања.",
                "ishod": "Студенти стичу општа знања и специфичне вештине на основу којих постају компетентни за анализу процеса у пословном систему и његове функционалне структуре, као и решавање конкретних организационих проблема у раду пословних система. Стечена знања и вештине директно се користе у радној пракси, као и комплексним пројектима развоја информационих система.",
                "sadrzaj": "Развој организације процеса рада и пословних система. Мисија, циљеви и политике пословних система. Основни токови, функционална структура и организациона структура пословних система. Људски ресурси пословних система - карактеристике, компетентност, мотивација и тимски рад. Инфраструктурни ресурси пословних система - капацитет и флексибилност. Методе и технике управљања и унапређења процеса рада и пословања. Електронско пословање и процеси управљања пословним системима - планирање, координација и регулација послова. Бизнис планови. Управљање пројектима. Основне карактеристике и показатељи ефективности пословних система. Модел унапређења процеса пословања CMMI. Увод у информационе системе. Архитектура информационих система. Процес развоја информационих система. Методологија животног циклуса и модели процеса развоја информационих система. Стратешко планирање и метода BSP. Структурна систем анализа."
            },
            {
                "ime": "Системско програмирање у Андроиду",
                "cilj": "Предмет се ослања на материју обрађену у оквиру предмета 'Пројектовање и архитектура рачунарских система - Системи засновани на Андроиду'. Надограђује је концептима и методама пројектовања системског софтвера на модерним наменским платформама. За разлику од тема покривених програмом 'Пројектовање и архитектура рачунарских система - Системи засновани на Андроиду', које првенствено укључују програмирање апликативног слоја, овај предмет је конципиран тако да студентима приближи начине функционисања језгра оперативног система уграђених уређаја. Неки од механизама који се изучавају су: - Међу-процесна комуникација - Напредне технике дељења меморије - Проток података кроз слојеве оперативног система - Управљање мултимедијалним и графичким подсистемима",
                "ishod": "Сви концепти су практично објашњени на примеру Андроид платформе, као једне од тренутно најзаступљенијих платформи на тржишту наменских система. Студенти ће у оквиру предмета стећи теоријска и практична знања из архитектуре и пројектовања системског софтвера, као и моделовања језгра оперативног система. Практични део предмета се ради у програмским језицима C, C++ и Јава. Циљ предмета је да су студенти на крају курса: - Упознати са концептима функционисања модерног оперативног система на уграђеној платформи - Упознати са системском архитектуром Андроид оперативног система - Способни да самостално моделују и мењају системске компоненте Андроида - Способни да презентују резултате: - Кроз документацију - Кроз персоналну презентацију",
                "sadrzaj": "На почетку курса објашњавају се основни концепти и софтверска архитектура Андроид оперативног система. Након тога, излажу се основни принципи генерисања извршног кода, као и напредне технике за уклањање грешака. Потом се излажу основни системски концепти, као што су Binder, Ashmem, и кретање информација и података кроз софтверске нивое Андроида. Након тога, излажу се модули специфични за Андроид платформу: - Мултимедијални и графички подсистем - ТВ екстензије - Јава run-time (ART) За крај, презентује се и еволуција и распрострањеност Андроид платформе на модерним (не увек потрошачким) уређајима. Оцењивање рада студената је на основу теоријског знања, рада у лабораторији и реализованог пројектног задатка."
            }
        ]
    }
}